benchmark/results/run_20260123_140333/homepage.txt
Running 30s test @ http://127.0.0.1:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.47ms    4.84ms  25.42ms   35.36%
    Req/Sec     4.68k   424.12    15.40k    87.01%
  Latency Distribution
     50%    6.08ms
     75%   10.16ms
     90%   11.28ms
     99%   12.90ms
  559688 requests in 30.10s, 138.47MB read
Requests/sec:  18594.17
Transfer/sec:      4.60MB