benchmark/results/run_20260123_140333/large_file.txt
Running 30s test @ http://127.0.0.1:8080/static/large.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.38ms   15.43ms 143.87ms   45.08%
    Req/Sec     1.59k   184.42     2.46k    90.66%
  Latency Distribution
     50%   17.25ms
     75%   29.92ms
     90%   32.24ms
     99%   46.35ms
  190344 requests in 30.02s, 17.77GB read
Requests/sec:   6340.93
Transfer/sec:    606.18MB